{
  "char_to_idx": {
    "a": 0,
    "b": 1,
    "c": 2,
    "d": 3,
    "e": 4,
    "f": 5,
    "g": 6,
    "h": 7,
    "i": 8,
    "j": 9,
    "k": 10,
    "l": 11,
    "m": 12,
    "n": 13,
    "o": 14,
    "p": 15,
    "q": 16,
    "r": 17,
    "s": 18,
    "t": 19,
    "u": 20,
    "v": 21,
    "w": 22,
    "x": 23,
    "y": 24,
    "z": 25,
    "A": 26,
    "B": 27,
    "C": 28,
    "D": 29,
    "E": 30,
    "F": 31,
    "G": 32,
    "H": 33,
    "I": 34,
    "J": 35,
    "K": 36,
    "L": 37,
    "M": 38,
    "N": 39,
    "O": 40,
    "P": 41,
    "Q": 42,
    "R": 43,
    "S": 44,
    "T": 45,
    "U": 46,
    "V": 47,
    "W": 48,
    "X": 49,
    "Y": 50,
    "Z": 51,
    "0": 52,
    "1": 53,
    "2": 54,
    "3": 55,
    "4": 56,
    "5": 57,
    "6": 58,
    "7": 59,
    "8": 60,
    "9": 61,
    "!": 62,
    "\"": 63,
    "#": 64,
    "$": 65,
    "%": 66,
    "&": 67,
    "'": 68,
    "(": 69,
    ")": 70,
    "*": 71,
    "+": 72,
    ",": 73,
    "-": 74,
    ".": 75,
    "/": 76,
    ":": 77,
    ";": 78,
    "<": 79,
    "=": 80,
    ">": 81,
    "?": 82,
    "@": 83,
    "[": 84,
    "\\": 85,
    "]": 86,
    "^": 87,
    "_": 88,
    "`": 89,
    "{": 90,
    "|": 91,
    "}": 92,
    "~": 93,
    " ": 94,
    "\n": 95,
    "\t": 96,
    "LINKA": 97,
    "LINKB": 98,
    "LINKC": 99,
    "CALLA": 100,
    "CALLB": 101,
    "CALLC": 102,
    "FILEA": 103,
    "FILEB": 104,
    "FILEC": 105,
    "LINEBREAK": 106,
    "TAB": 107,
    "DOUBLESPACE": 108,
    "LINK4": 109,
    "CALL4": 110,
    "FILE4": 111,
    "LINK5": 112,
    "CALL5": 113,
    "FILE5": 114,
    "LINK6": 115,
    "CALL6": 116,
    "FILE6": 117,
    "LINK7": 118,
    "CALL7": 119,
    "FILE7": 120,
    "LINK8": 121,
    "CALL8": 122,
    "FILE8": 123,
    "LINK9": 124,
    "CALL9": 125,
    "FILE9": 126,
    "LINK10": 127,
    "CALL10": 128,
    "FILE10": 129,
    "<UNK>": 130,
    "<PAD>": 131
  },
  "idx_to_char": {
    "0": "a",
    "1": "b",
    "2": "c",
    "3": "d",
    "4": "e",
    "5": "f",
    "6": "g",
    "7": "h",
    "8": "i",
    "9": "j",
    "10": "k",
    "11": "l",
    "12": "m",
    "13": "n",
    "14": "o",
    "15": "p",
    "16": "q",
    "17": "r",
    "18": "s",
    "19": "t",
    "20": "u",
    "21": "v",
    "22": "w",
    "23": "x",
    "24": "y",
    "25": "z",
    "26": "A",
    "27": "B",
    "28": "C",
    "29": "D",
    "30": "E",
    "31": "F",
    "32": "G",
    "33": "H",
    "34": "I",
    "35": "J",
    "36": "K",
    "37": "L",
    "38": "M",
    "39": "N",
    "40": "O",
    "41": "P",
    "42": "Q",
    "43": "R",
    "44": "S",
    "45": "T",
    "46": "U",
    "47": "V",
    "48": "W",
    "49": "X",
    "50": "Y",
    "51": "Z",
    "52": "0",
    "53": "1",
    "54": "2",
    "55": "3",
    "56": "4",
    "57": "5",
    "58": "6",
    "59": "7",
    "60": "8",
    "61": "9",
    "62": "!",
    "63": "\"",
    "64": "#",
    "65": "$",
    "66": "%",
    "67": "&",
    "68": "'",
    "69": "(",
    "70": ")",
    "71": "*",
    "72": "+",
    "73": ",",
    "74": "-",
    "75": ".",
    "76": "/",
    "77": ":",
    "78": ";",
    "79": "<",
    "80": "=",
    "81": ">",
    "82": "?",
    "83": "@",
    "84": "[",
    "85": "\\",
    "86": "]",
    "87": "^",
    "88": "_",
    "89": "`",
    "90": "{",
    "91": "|",
    "92": "}",
    "93": "~",
    "94": " ",
    "95": "\n",
    "96": "\t",
    "97": "LINKA",
    "98": "LINKB",
    "99": "LINKC",
    "100": "CALLA",
    "101": "CALLB",
    "102": "CALLC",
    "103": "FILEA",
    "104": "FILEB",
    "105": "FILEC",
    "106": "LINEBREAK",
    "107": "TAB",
    "108": "DOUBLESPACE",
    "109": "LINK4",
    "110": "CALL4",
    "111": "FILE4",
    "112": "LINK5",
    "113": "CALL5",
    "114": "FILE5",
    "115": "LINK6",
    "116": "CALL6",
    "117": "FILE6",
    "118": "LINK7",
    "119": "CALL7",
    "120": "FILE7",
    "121": "LINK8",
    "122": "CALL8",
    "123": "FILE8",
    "124": "LINK9",
    "125": "CALL9",
    "126": "FILE9",
    "127": "LINK10",
    "128": "CALL10",
    "129": "FILE10",
    "130": "<UNK>",
    "131": "<PAD>"
  }
}